Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: བདག་གིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འཁོར་བརྒྱད་ཁྲི་དང་བཅས་པ་བདེན་པ་རྣམས་ལ་དགོད་པར་བྱ་དགོས་སོ་
en: “I must establish Śakra, King of the Gods, and his suite of eighty thousand attendants in the truths.”

source: སྙམ་དུ་དགོངས་ནས། རྒྱལ་པོའི་ཁབ་ནས་མི་སྣང་བར་གྱུར་ཏེ། རྒྱལ་པོའི་ཁབ་ཀྱི་ལྷོ་ཕྱོགས་ན། བྲམ་ཟེའི་གྲོང་ཨ་མྲའི་ནགས་ཁྲོད་ཅེས་བྱ་བ་དེའི་བྱང་ཕྱོགས་ན།
en: With this thought he disappeared from Rājagṛha and traveled to Indra’s cave on Mount Videha, south of Rājagṛha and north of a brahmin village called Mango Forest.

source: རི་བི་དེ་ཧའི་དབང་པོའི་བྲག་ཕུག་ཏུ་གཤེགས་ནས་མེའི་ཁམས་ལ་སྙོམས་པར་ཞུགས་སོ། །དེའི་ཚེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམས་པ།
en: As the Blessed One entered into equipoise on the element of fire, Śakra, King of the Gods, thought,

source: ད་ནི་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་ཞུ་བ་ལུང་བསྟན་པ་ཞུ་བའི་དུས་ལ་བབ་པོ་སྙམ་ནས།
en: “Now the time has come for me to ask the Blessed One my question.”

source: ལྷའི་འཁོར་བརྒྱད་ཁྲི་དང་། ལྷ་མ་ཡིན་གྱི་བུ་མོ་བདེ་སོགས་དང་། དྲི་ཟའི་བུ་ཟུར་ཕུད་ལྔ་པ་དང་ཐབས་ཅིག་ཏུ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་ནས་མི་སྣང་བར་གྱུར་ཏེརི་བི་དེ་ཧ་ལར་འཁོད་ནས།
en: His suite of eighty thousand divine attendants, the young demigoddess Śacī, and the young gandharva Pañcaśikha all disappeared from the Heaven of the Thirty-Three and came to sit upon Mount Videha.

source: དེར་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། དེ་མ་ཡིན་པའི་ལྷ་སྟོང་ཕྲག་དུ་མའི་ཁ་དོག་གི་མཐུས་རི་བི་དེ་ཧ་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: Then, by the power of the bodily presence of Śakra, King of the Gods, and that of the other thousands of demigods, great rays of light spread all over Mount Videha.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དབང་པོའི་བྲག་ཕུག་ཏུ་ཞུགས་ནས། བཅོམ་ལྡན་འདས་མེའི་ཁམས་ལ་སྙོམས་པར་ཞུགས་པ་མཐོང་ངོ་། །
en: Śakra, King of the Gods, entered Indra’s cave, and upon entering, saw the Blessed One sitting in equipoise on the element of fire.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་མེའི་ཁམས་ལ་སྙོམས་པར་ཞུགས་པ་ལས་ན།
en: “The Blessed Buddha has entered into equipoise on the element of fire

source: ཡང་བདག་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འགྲོ་བ་དང་བལྟ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་དུས་ལ་མ་བབ་པོ་སྙམ་ནས།
en: —the time has not yet come for me to go to the Blessed One and offer my help and respect.”

source: ཐང་ཅིག་ཅང་མི་ཟེར་བར་འདུག་ནས་
en: For a moment he sat without saying anything,

source: དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་པ་ལ་སྨྲས་པ།
en: then he said to the young gandharva Pañcaśikha,

source: བུ་གཙུག་ཕུད་ལྔ་པ་ཁྱོད་ཀྱིས་བཅོམ་ལྡན་འདས་སྔར་བཞེངས་པར་བྱེད་ནུས་སམ།
en: “Pañcaśikha, child, could you cause the Blessed One to stir?

source: དེ་ལྟར་བྱས་པ་དང་། དེའི་འོག་ཏུ་བདག་ཅག་བལྟ་བའི་ཕྱིར་འགྲོ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་སླ་བར་འགྱུར་རོ། །
en: If you do so, it will be easy for us to go to the Blessed One and offer our help and respect.”

source: གཙུག་ཕུད་ལྔ་པས་སྨྲས་པ། ཀཽ་ཤི་ཀ་བདག་གིས་ནུས་ཆེས་སོ་ཞེས་སྨྲས་ནས།
en: “Yes, Kauśika, I believe I could,” Pañcaśikha replied.

source: གཡོག་འཁོར་ལྔ་བརྒྱ་དང་། བཻ་ཌཱུརྱའི་པི་བང་བླངས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Taking up a guitar of beryl, with a suite of five hundred attendants he approached the Blessed One.

source: གཙོ་བོ་ལ་འོས་པ་དང་། དགྲ་བཅོམ་པ་ལ་འོས་པའི་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས། བཅོམ་ལྡན་འདས་བཞེངས་སུ་གསོལ་ནས།
en: He bid the Blessed One to stir with verses worthy of the Lord and worthy of the arhats.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then Pañcaśikha returned to Śakra, King of the Gods, and said to him,

source: ཀཽ་ཤི་ཀ་བཅོམ་ལྡན་འདས་བཞེངས་ལགས་ཏེ།
en: “The Blessed One stirs, Kauśika.

source: ཁྱོད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་བལྟ་བར་འགྲོ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་དུས་ལ་བབ་བོ། །
en: The time has come for you to go see the Blessed One and to offer him your help and respect.”

source: ཀྱེ་མ་དབང་པོའི་བྲག་ཕུག་འདི་ནི་དོག་ཆེས་ལ་ལྷའི་འཁོར་ནི་མང་ཆེས་ཀྱིས།
en: “Alas, this cave is very narrow, and that god’s suite of attendants is very large.

source: མ་ལ་བདག་གིས་ཕུག་འདི་ཅི་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འཁོར་དང་བཅས་པ། བདེ་བླག་ཏུ་ཆོས་ཉན་ཅིང་འཁོད་དུ་ཡོད་པ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབ་པར་བྱའོ་སྙམ་དུ་དགོངས་ནས
en: I will perform a miracle that causes Śakra, King of the Gods, and his suite of attendants to be easily accommodated, that they might sit and listen to the Dharma.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དབང་པོའི་བྲག་ཕུག་ཡངས་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: Then the Blessed One performed a miracle that caused Indra’s cave to be large and open.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལྷ་མ་ཡིན་གྱི་བུ་མོ་བདེ་སོགས་དང་ལྷ་བརྒྱད་ཁྲི་དང་ཐབས་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Śakra, King of the Gods, and his suite of eighty thousand divine attendants, the young demigoddess Śacī, and the young gandharva Pañcaśikha all approached the Blessed One.

source: ཆོས་ཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་ནས།
en: and sat before him to listen to the Dharma.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་གཏམ་རྒྱུད་སྔ་མའི་དོན། བཅོམ་ལྡན་འདས་ལ་གསོལ་ནས།
en: Śakra, King of the Gods, shared the story of his previous exploits with the Blessed One,

source: བརྒྱ་བྱིན་གྱིས་ཞུ་བ་ཞུས་པ་བཙུན་པ་ལྷ་རྣམས་དང་། མི་རྣམས་དང་ལྷ་མ་ཡིན་རྣམས་དང་། ཀླུ་རྣམས་དང་། ནམ་མཁའ་ལྡིང་རྣམས་དང་། དྲི་ཟ་རྣམས་དང་། ལུས་ཐ་དད་པ་གཞན་དག་ཀྱང་རུང་སྟེདེ་དག་གི་སྦྱོར་བ་ཅི་ལགས།
en: and then asked his question: “Lord, what are the fetters of gods, humans, demigods, nāgas, garuḍas, gandharvas, or those with any other kind of bodily form?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་ལྷ་རྣམས་དང་། མི་རྣམས་དང་། ལྷ་མ་ཡིན་རྣམས་དང་། ཀླུ་རྣམས་དང་། ནམ་མཁའ་ལྡིང་རྣམས་དང་། དྲི་ཟ་རྣམས་དང་། ལུས་ཐ་དད་པ་གཞན་དག་ཀྱང་རུང་སྟེ
en: “Kauśika,” the Blessed One replied, “envy and avarice are what binds the gods, humans, demigods, nāgas, garuḍas, gandharvas, and those with any other kind of bodily form.

source: དེ་དག་གི་སྦྱོར་བ་ནི་ཕྲག་དོག་དང་སེར་སྣ་ཡིན་ཏེ། དེ་དག་འདི་སྙམ་དུ་ཀྱེ་མ་བདག་ཁོ་ན་མེད་པ་དང་། འགྲན་ཟླ་མེད་པ་དང་། གནོད་པ་མེད་པ་དང་། འཐབ་མོ་མེད་པ་དང་། མཚང་འདྲུ་བ་མེད་པ་དང་འགྱེད་པ་མེད་པ་དང་། རྩོད་པ་མེད་པས་གནས་པར་བྱའོ་སྙམ་དུ་མི་སེམས་མོད་ཀྱི།
en: They don’t think, ‘I should live without resentment, enmity, ill will, strife, reproof, conflict, and contention.’

source: འོན་ཀྱང་དེ་དག་ནི་ཁོན་དང་བཅས་པ་དང་། འགྲན་ཟླ་དང་བཅས་པ་དང་། གནོད་པ་དང་བཅས་པ་དང་། འཐབ་མོ་དང་བཅས་པ་དང་། མཚང་འདྲུ་བ་དང་བཅས་པ་དང་། འགྱེད་པ་དང་བཅས་པ་དང་། རྩོད་པ་དང་བཅས་པ་ལ་གནས་སོ། །
en: Instead they live in resentment, enmity, ill will, strife, reproof, conflict, and contention.”

source: བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཙུན་པ་དེ་ནི་དེ་ལགས་སོ། །དེ་ནི་དེ་ལགས་ཏེ།
en: “Lord, so it is,” said Śakra. “It is just as you say.

source: ལྷ་རྣམས་དང་། མི་རྣམས་དང་། ལྷ་མ་ཡིན་རྣམས་དང་། ཀླུ་རྣམས་དང་། ནམ་མཁའ་ལྡིང་རྣམས་དང་། དྲི་ཟ་རྣམས་དང་། ལུས་ཐ་དད་པ་གཞན་དག་ཀྱང་རུང་སྟེ
en: Envy and avarice are what binds the gods, humans, demigods, nāgas, garuḍas, gandharvas, and those with any other kind of bodily forms.

source: དེ་དག་གི་སྦྱོར་བ་ནི་ཕྲག་དོག་དང་སེར་སྣ་ལགས་ཏེ། དེ་དག་ནི་འདི་སྙམ་དུ་ཀྱེ་མ་བདག་ཁོ་ན་མེད་པ་དང་། འགྲན་ཟླ་མེད་པ་དང་གནོད་པ་མེད་པ་དང་། འཐབ་མོ་མེད་པ་དང་། མཚང་འདྲུ་བ་མེད་པ་དང་། འགྱེད་པ་མེད་པ་དང་། རྩོད་པ་མེད་པར་གནས་པར་བྱའོ། །སྙམ་དུ་མི་སེམས་མོད་ཀྱི།
en: They don’t think, ‘I should live without resentment, enmity, ill will, strife, reproof, conflict, and contention.’

source: འོན་ཀྱང་དེ་དག་ནི་ཁོན་དང་བཅས་པ་དང་། འགྲན་ཟླ་དང་བཅས་པ་དང་། གནོད་པ་དང་བཅས་པ་དང་། འཐབ་མོ་དང་བཅས་པ་དང་། མཚང་འདྲུ་བ་དང་བཅས་པ་དང་། འགྱེད་པ་དང་བཅས་པ་དང་། རྩོད་པ་དང་བཅས་པས་གནས་ལགས་སོ། །
en: Instead they live in resentment, enmity, ill will, strife, reproof, conflict, and contention.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་འདི་བདག་གིས་རྟོགས་ནསསོམ་ཉི་ལས་བརྒལ་ཏེ། ཐེ་ཙོམ་དང་བྲལ་ལགས་སོ། །
en: I have understood the meaning of the Blessed One’s words, overcome my doubt, and have no hesitation.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་ལས་ཞུ་བ་ལུང་བསྟན་པ་ཐོས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་བསྟོད་ཅིང་། རྗེས་སུ་ཡི་རངས་ནས་བཅོམ་ལྡན་འདས་ལ་ཞུ་བ་ཕྱི་མ་ཞུས་པ།
en: After he heard the Blessed One’s response to his questions, Śakra, King of the Gods, praised what the Blessed One said, rejoiced, and asked the Blessed One other questions.

source: བཙུན་པ་ཕྲག་དོག་དང་། སེར་སྣའི་གཞི་ནི་ཅི་ལགས།
en: “Lord, on what are envy and avarice founded?

source: ཀུན་འབྱུང་བ་ནི་ཅི་ལགས།
en: What is their origin?

source: རྣམ་པ་ནི་ཅི་ལགས།
en: What are their aspects?

source: ཅི་ལས་ནི་སྐྱེས་ལགས།
en: Whence are they born?

source: གང་མཆིས་ན་ཕྲག་དོག་དང་སེར་སྣ་འབྱུང་བར་འགྱུར་ལགས།
en: What must be present for envy and avarice to arise?

source: གང་མ་མཆིས་ན་ཕྲག་དོག་དང་སེར་སྣ་འབྱུང་བར་མི་འགྱུར་ལགས།
en: What must be absent for envy and avarice not to arise?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་ཕྲག་དོག་དང་། སེར་སྣའི་གཞི་ནི་དགའ་བ་དང་། མི་དགའ་བའོ། །
en: “Kauśika,” the Blessed One replied, “envy and avarice are founded on affinity and antipathy.

source: ཀུན་འབྱུང་བ་ནི་དགའ་བ་དང་མི་དགའ་བའོ། །
en: Affinity and antipathy are their origins.

source: རྣམ་པ་ནི་དགའ་བ་དང་མི་དགའ་བའོ། །
en: Affinity and antipathy are their aspects.

source: སྐྱེ་བ་ནི་དགའ་བ་དང་མི་དགའ་བ་སྟེ།
en: They are born from affinity and antipathy.

source: དགའ་བ་དང་མི་དགའ་བ་ཡོད་ན། ཕྲག་དོག་དང་སེར་སྣ་འབྱུང་བར་འགྱུར་ལ།
en: Where there is affinity and antipathy, envy and avarice will arise.

source: དགའ་བ་དང་མི་དགའ་བ་མེད་ན་ཕྲག་དོག་དང་སེར་སྣ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: Where there is neither affinity nor antipathy, envy and avarice will not arise.”

source: ཕྲག་དོག་དང་སེར་སྣའི་གཞི་ནི་དགའ་བ་དང་མི་དགའ་བ་ལགས་སོ། །
en: “Envy and avarice are founded on affinity and antipathy.

source: ཀུན་འབྱུང་བ་ནི་དགའ་བ་དང་མི་དགའ་བ་ལགས་སོ། །
en: Affinity and antipathy are their origins.

source: རྣམ་པ་ནི་དགའ་བ་དང་མི་དགའ་བ་ལགས་སོ། །
en: Affinity and antipathy are their aspects.

source: སྐྱེ་བ་ནི་དགའ་བ་དང་མི་དགའ་བ་ལགས་ཏེ།
en: They are born from affinity and antipathy.

source: དགའ་བ་མཆིས་ན། ཕྲག་དོག་དང་སེར་སྣ་འབྱུང་བར་འགྱུར་ལ།
en: Where there is affinity and antipathy, envy and avarice will arise.

source: དགའ་བ་དང་མི་དགའ་བ་མ་མཆིས་ན། ཕྲག་དོག་དང་སེར་སྣ་འབྱུང་བར་མི་འགྱུར་ཏེ།
en: Where there is neither affinity nor antipathy, envy and avarice will not arise.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་འདི་བདག་གིས་རྟོགས་ནས། སོམ་ཉི་ལས་བརྒལ་ཏེ། ཐེ་ཙོམ་དང་བྲལ་ལགས་སོ། །
en: I have understood the meaning of the Blessed One’s words, overcome my doubt, and have no hesitation.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་ལས་ཞུ་བ་ལུང་བསྟན་པ་ཐོས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་བསྟོད་ཅིང་རྗེས་སུ་ཡི་རངས་ནས་བཅོམ་ལྡན་འདས་ལ་ཞུ་བ་ཕྱི་མ་ཞུས་པ།
en: After Śakra, King of the Gods, heard the Blessed One’s response to his questions, he rejoiced and asked the Blessed One other questions.

source: བཙུན་པ་དགའ་བ་དང་མི་དགའ་བའི་གཞི་ནི་ཅི་ལགས།
en: “Lord, on what are affinity and antipathy founded?

source: གང་མཆིས་ན་དགའ་བ་དང་མི་དགའ་བ་འབྱུང་བར་འགྱུར་ལ།
en: What must be present for affinity and antipathy to arise?

source: གང་མ་མཆིས་ན་དགའ་བ་དང་མི་དགའ་བ་འབྱུང་བར་མི་འགྱུར་བ་ལགས།
en: What must be absent for affinity and antipathy not to arise?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དགའ་བ་དང་། མི་དགའ་བའི་གཞི་ནི་འདུན་པའོ། །
en: “Kauśika,” the Blessed One replied, “affinity and antipathy are founded on craving.

source: ཀུན་འབྱུང་བ་ནི་འདུན་པའོ། །
en: Craving is their origin.

source: རྣམ་པ་ནི་འདུན་པའོ། །
en: Craving is their aspect.

source: སྐྱེ་བ་ནི་འདུན་པའོ། །
en: They are born from craving.

source: འདུན་པ་ཡོད་ན་དགའ་བ་དང་མི་དགའ་བ་འབྱུང་བར་འགྱུར་ལ་
en: Where there is craving, affinity and antipathy will arise.

source: འདུན་པ་མེད་ན་དགའ་བ་དང་། མི་དགའ་བ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: Where there is no craving, affinity and antipathy will not arise.”

source: དགའ་བ་དང་མི་དགའ་བའི་གཞི་ནི་འདུན་པ་ལགས་སོ། །
en: “Affinity and antipathy are founded on craving.

source: ཀུན་འབྱུང་བ་ནི་འདུན་པ་ལགས་སོ། །
en: Craving is their origin.

source: རྣམ་པ་ནི་འདུན་པ་ལགས་སོ། །
en: Craving is their aspect.

source: སྐྱེ་བ་ནི་འདུན་པ་ལགས་ཏེ།
en: They are born from craving.

source: འདུན་པ་མཆིས་ན་དགའ་བ་དང་མི་དགའ་བ་འབྱུང་བར་འགྱུར་ལ།
en: Where there is craving, affinity and antipathy will arise.

source: འདུན་པ་མ་མཆིས་ན་དགའ་བ་དང་མི་དགའ་བ་འབྱུང་བར་མི་འགྱུར་ཏེ།
en: Where there is no craving, affinity and antipathy will not arise.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་འདི་བདག་གིས་རྟོགས་ནས། སོམ་ཉི་ལས་བརྒལ་ཏེ་ཐེ་ཙོམ་དང་བྲལ་ལགས་སོ། །
en: I have understood the meaning of the Blessed One’s words, overcome my doubt, and have no hesitation.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་ལས་ཞུ་བ་ལུང་བསྟན་པ་ཐོས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་བསྟོད་ཅིང་རྗེས་སུ་ཡི་རངས་ནས། བཅོམ་ལྡན་འདས་ལ་ཞུ་བ་ཕྱི་མ་ཞུས་པ།
en: After Śakra, King of the Gods, had heard the Blessed One’s response to his questions, he praised what the Blessed One said, rejoiced, and asked the Blessed One other questions.

source: བཙུན་པ་འདུན་པའི་གཞི་ནི་ཅི་ལགས།
en: “Lord, on what is craving founded?

source: ཀུན་འབྱུང་བ་ནི་ཅི་ལགས། རྣ
en: What is its origin?

source: མ་པ་ནི་ཅི་ལགས།
en: What are its aspects?

source: གང་མཆིས་ན་འདུན་པ་འབྱུང་བར་འགྱུར་ལ།
en: What must be present for craving to arise?

source: གང་མ་མཆིས་ན་འདུན་པ་འབྱུང་བར་མི་འགྱུར་ལགས།
en: What must be absent for craving not to arise?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་འདུན་པའི་གཞི་ནི་རྟོག་པའོ། །
en: “Kauśika,” the Blessed One replied, “craving is founded on thought construction.

source: ཀུན་འབྱུང་བ་ནི་རྟོག་པའོ། །
en: Thought construction is its origin.

source: རྣམ་པ་ནི་རྟོག་པའོ། །
en: Thought construction is its aspect.

source: སྐྱེ་བ་ནི་རྟོག་པ་སྟེ།
en: It is born from thought construction.

source: རྟོག་པ་ཡོད་ན་འདུན་པ་འབྱུང་བར་འགྱུར་ལ།
en: Where there is thought construction, craving will arise.

source: རྟོག་པ་མེད་ན་འདུན་པ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: Where there is no thought construction, craving will not arise.”

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཙུན་པ་དེ་ནི་དེ་ལགས་སོ། །དེ་ནི་དེ་ལགས་ཏེ།
en: “Lord, so it is. It is just as you say,” Śakra agreed.

source: འདུན་པའི་གཞི་ནི་རྟོག་པ་ལགས་སོ། །
en: “Craving is founded on thought construction.

source: ཀུན་འབྱུང་བ་ནི་རྟོག་པ་ལགས་སོ། །
en: Thought construction is its origin.

source: རྣམ་པ་ནི་རྟོག་པ་ལགས་སོ། །
en: Thought construction is its aspect.

source: སྐྱེ་བ་ནི་རྟོག་པ་ལགས་ཏེ།
en: Of thought construction it is born.

source: རྟོག་པ་མེད་ན་འདུན་པ་འབྱུང་བར་མི་འགྱུར་ཏེ།
en: Where there is no thought construction, craving will not arise.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་འདི་བདག་གིས་རྟོགས་ནས་སོམ་ཉི་ལས་བརྒལ་ཏེ། ཐེ་ཙོམ་དང་བྲལ་ལགས་སོ། །
en: I have understood the meaning of the Blessed One’s words, overcome my doubt, and have no hesitation.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་བསྟོད་ཅིང་རྗེས་སུ་ཡི་རངས་ནས། བཅོམ་ལྡན་འདས་ལ་ཞུ་བ་ཕྱི་མ་ཞུས་པ།
en: After Śakra, King of the Gods, had heard the Blessed One’s response to his questions, he praised what the Blessed One said, rejoiced, and asked the Blessed One other questions.

source: བཙུན་པ་རྟོག་པའི་གཞི་ནི་ཅི་ལགས།
en: “Lord, on what is thought construction founded?

source: གང་མཆིས་ན་རྟོག་པ་འབྱུང་བར་འགྱུར་ལ།
en: What must be present for thought construction to arise?

source: གང་མ་མཆིས་ན་རྟོག་པ་འབྱུང་བར་མི་འགྱུར་ལགས།
en: What must be absent for thought construction not to arise?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་རྟོག་པའི་གཞི་ནི་སྤྲོས་པའོ། །
en: “Kauśika,” the Blessed One replied, “thought construction is founded on discursive elaboration.

source: ཀུན་འབྱུང་བ་ནི་སྤྲོས་པའོ། །
en: Discursive elaboration is its origin.

source: རྣམ་པ་ནི་སྤྲོས་པའོ། །
en: Discursive elaboration is its aspect.

source: སྐྱེ་བ་ནི་སྤྲོས་པ་སྟེ།
en: It is born from discursive elaboration.

source: སྤྲོས་པ་ཡོད་ན་རྟོག་པ་འབྱུང་བར་འགྱུར་ལ།
en: Where there is discursive elaboration, thought construction will arise.

source: སྤྲོས་པ་མེད་ན་རྟོག་པ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: Where there is no discursive elaboration, thought construction will not arise.

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་སྤྲོས་པ་ཡོད་ན་རྟོག་པ་འབྱུང་བར་འགྱུར་རོ། །
en: “Kauśika, accordingly, where there is discursive elaboration, thought construction will arise.

source: རྟོག་པ་ཡོད་ན་འདུན་པ་འབྱུང་བར་འགྱུར་རོ། །
en: Where there is thought construction, craving will arise.

source: འདུན་པ་ཡོད་ན་དགའ་བ་དང་མི་དགའ་བ་འབྱུང་བར་འགྱུར་རོ། །
en: Where there is craving, affinity and antipathy will arise.

source: དགའ་བ་དང་མི་དགའ་བ་ཡོད་ན་ཕྲག་དོག་དང་སེར་སྣ་འབྱུང་བར་འགྱུར་རོ། །
en: Where there is affinity and antipathy, envy and avarice will arise.

source: ཕྲག་དོག་དང་སེར་སྣ་ཡོད་ན་དབྱུག་པ་ཐོགས་པ་དང་། མཚོན་ཆ་ཐོགས་པ་དང་། འཐབ་པ་དང་། མཚང་འདྲུ་བ་དང་། འགྱེད་པ་དང་རྩོད་པ་དང་གཡོ་བྱེད་པ་དང་འདྲིད་པ་དང་ཆད་པས་གཅོད་པ་དང་། བརྫུན་ཟེར་བ་དང་། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམ་པ་དུ་མ་འབྱུང་བར་འགྱུར་ཏེ
en: Where there is envy and avarice, there will be cudgels hefted, weapons taken up, strife, reproof, conflict, contention, cunning, deceit, retribution, lies disseminated, and many such nonvirtuous, sinful things.

source: དེ་ལྟར་ན་སྤྲོས་པ་མེད་ན་རྟོག་པ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: “Accordingly, where there is no discursive elaboration, thought construction will not arise.

source: འདུན་པ་མེད་ན་དགའ་བ་དང་མི་དགའ་བ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: Where there is no craving, affinity and antipathy will not arise.

source: ཕྲག་དོག་དང་སེར་སྣ་མེད་ན་དབྱུག་པ་ཐོགས་པ་དང་། མཚོན་ཆ་ཐོགས་པ་དང་། འཐབ་པ་དང་། མཚང་འདྲུ་བ་དང་། འགྱེད་པ་དང་། རྩོད་པ་དང་། གཡོ་བྱེད་པ་དང་། འདྲིད་པ་དང་། ཆད་པས་གཅོད་པ་དང་། བརྫུན་ཟེར་བ་དང་། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམ་པ་དུ་མ་འགག་པར་འགྱུར་ཏེ
en: When there is no envy and avarice, the hefting of cudgels, the taking up of weapons, strife, reproof, war, contention, cunning, deceit, retribution, the dissemination of lies, and any such nonvirtuous, sinful dharmas all will cease.

source: རྟོག་པའི་གཞི་ནི་སྤྲོས་པ་ལགས་སོ། །
en: Thought construction is founded on discursive elaboration.

source: ཀུན་འབྱུང་བ་ནི་སྤྲོས་པ་ལགས་སོ། །
en: Discursive elaboration is its origin.

source: རྣམ་པ་ནི་སྤྲོས་པ་ལགས་སོ། །
en: Discursive elaboration is its aspect.

source: སྐྱེ་བ་ནི་སྤྲོས་པ་ལགས་སོ། །
en: It is born from discursive elaboration.

source: སྤྲོས་པ་མཆིས་ན་
en: Where there is discursive elaboration, thought construction will arise.

source: རྟོག་པ་འབྱུང་བར་འགྱུར་ལ། སྤྲོས་པ་མ་མཆིས་ན་རྟོག་པ་འབྱུང་བར་མི་འགྱུར་ལགས་སོ། །
en: Where there is no discursive elaboration, thought construction will not arise.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་འདི་བདག་གིས་རྟོགས་ནས་སོམ་ཉི་ལས་བརྒལ་ཏེཐེ་ཙོམ་དང་བྲལ་ལགས་སོ། །
en: I have understood the meaning of the Blessed One’s words, overcome my doubt, and have no hesitation.”

source: བཙུན་པ་སྤྲོས་པ་འགག་པར་འགྱུར་བའི་ལམ་ཞེས་གསུང་ན།
en: “Lord, it is said that there is a path to stopping discursive elaboration.

source: བཙུན་པ་སྤྲོས་པ་འགག་པར་འགྱུར་བའི་ལམ་གང་ལགས།
en: Lord, what is the path to stopping discursive elaboration?

source: དགེ་སློང་ལམ་གང་ལ་ཞུགས་ན་སྤྲོས་པ་འགག་པར་འགྱུར་བའི་ལམ་ལ་ཞུགས་པ་ལགས།
en: What is the path that, if the ordained set out upon it, will stop discursive elaboration?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་སྤྲོས་པ་འགག་པར་འགྱུར་བའི་ལམ་ནི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡིན་ཏེ
en: “Kauśika,” The Blessed One replied, “the path that stops discursive elaboration is the noble eightfold path,

source: འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏོ། །
en: namely, right view, right understanding, right speech, right action, right livelihood, right effort, right mindfulness, and right meditation.

source: འདི་ནི་སྤྲོས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཞེས་བྱ་སྟེ།
en: This is called the path that stops discursive elaboration.

source: དེ་ལྟ་བུ་ལ་ཞུགས་པའི་དགེ་སློང་ནི་སྤྲོས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལ་ཞུགས་པ་ཞེས་བྱའོ། །
en: The ordained who enter it are known as those who have entered the path that stops discursive elaboration.”

source: སྤྲོས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལ་ཞུགས་པ་དེ་ནི་དེ་ལགས་ཏེ།
en: “They are known as those who have entered the path that stops discursive elaboration.

source: བཙུན་པ་སྤྲོས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལ་ཞུགས་པའི་དགེ་སློང་གིས་སོ་སོར་ཐར་པའི་སྡོམ་པའི་རྒྱུ་ཆོས་དུ་ཞིག་མཆིས་ལགས།
en: “Lord, is there something that is the causal attribute of the prātimokṣa vows taken by the ordained who have entered the path that stops discursive elaboration?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་སྤྲོས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལ་ཞུགས་པའི་དགེ་སློང་གི་སོ་སོར་ཐར་པའི་སྡོམ་པའི་རྒྱུ་ནི་ཆོས་དྲུག་ཡོད་དེ
en: “Kauśika,” the Blessed One replied, “there are six causal attributes of the prātimokṣa vows taken by the ordained who have entered the path that stops discursive elaboration.

source: དྲུག་གང་ཞེ་ན། མིག་གིས་ཤེས་པར་བྱ་བའི་གཟུགས་རྣམས་དང་།
en: They are (1) the forms perceived by the eyes,

source: རྣ་བས་ཤེས་པར་བྱ་བའི་སྒྲ་རྣམས་དང་།
en: (2) the sounds perceived by the ears,

source: སྣས་ཤེས་པར་བྱ་བའི་དྲི་རྣམས་དང་།
en: (3) the smells perceived by the nose,

source: ལྕེས་ཤེས་པར་བྱ་བའི་རོ་རྣམས་དང་།
en: (4) the tastes perceived by the tongue,

source: ལུས་ཀྱིས་ཤེས་པར་བྱ་བའི་རེག་བྱ་རྣམས་དང་།
en: (5) the tangible objects perceived by the body, and

source: ཡིད་ཀྱིས་ཤེས་པར་བྱ་བའི་ཆོས་རྣམས་སོ། །
en: (6) the mental phenomena perceived by the mind.

source: ཀཽ་ཤི་ཀ་མིག་གིས་ཤེས་པར་བྱ་བའི་གཟུགས་རྣམས་ལ་ཡང་བསྟེན་པར་བྱ་བ་དང་། བསྟེན་པར་བྱ་བ་མ་ཡིན་པ་རྣམ་པ་གཉིས་ཡོད་དེ།
en: “Kauśika, I have said, ‘There are two types of forms that are perceived by the eyes—those that are trustworthy and those that are not trustworthy.’

source: དེ་ལ་མིག་གིས་ཤེས་པར་བྱ་བའི་གཟུགས་གང་ཡིན་པ་རྣམས་བསྒྲུབས་ཏེ། གནས་པར་བྱ་བའི་འོས་མ་ཡིན་པར་ངས་ཤེས་ནས། དེ་དག་ངེས་པར་སྤང་བར་བྱའོ་ཞེས་ང་ཟེར་རོ། །
en: I have said, ‘Any form perceived by the eyes that I have recognized as unsuitable to adopt and adhere to is surely to be abandoned.’

source: མིག་གིས་ཤེས་པར་བྱ་བའི་གཟུགས་གང་ཡིན་པ་རྣམས་བསྒྲུབས་ཏེ། གནས་པར་འོས་པ་ནི་བསྟེན་པར་བྱའོ་ཞེས་ང་ཟེར་རོ། །
en: And I have also said, ‘Any form perceived by the eyes that is suitable to adopt and adhere is to be trusted.’

source: དེ་ལ་དེ་བཞིན་གཤེགས་པ་ནི་དེའི་ལུང་སྟོན་པ་ལ་དུས་མཁྱེན་པར་བསྟན་ཏོ། །
en: Thus has the Tathāgata taught, knowing when the time is right for clarification on these.

source: དེ་བཞིན་དུ་རྣ་བས་ཤེས་པར་བྱ་བའི་སྒྲ་རྣམས་དང་།
en: “In the same way, I have also said, ‘There are two types of sounds perceived by the ears,

source: ཡིད་ཀྱིས་ཤེས་པར་བྱ་བའི་ཆོས་རྣམས་ལ་ཡང་བསྟེན་པར་བྱ་བ་དང་། བསྟེན་པར་བྱ་བ་མ་ཡིན་པ་རྣམ་པ་གཉིས་ཡོད་དོ་ཞེས་ང་ཟེར་རོ། །
en: and phenomena perceived by the mind—those that are trustworthy, and those that are not trustworthy.’

source: དེ་ལ་ཡིད་ཀྱིས་ཤེས་པར་བྱ་བའི་ཆོས་བསྒྲུབས་ཏེ། གནས་པར་བྱ་བའི་འོས་མ་ཡིན་པར་ཤེས་པ་གང་ཡིན་པ་དེ་དག་ནི་མངོན་དུ་ངེས་པར་སྤང་བ་ཡིན་ནོ་ཞེས་ང་ཟེར་རོ། །
en: I have also said about these, ‘One should absolutely and surely abandon mental phenomena known by mind that are recognized as unsuitable to adopt and adhere to.’

source: དེ་ལ་ཡིད་ཀྱིས་ཤེས་པར་བྱ་བའི་ཆོས་བསྒྲུབས་ཏེ། གནས་པར་བྱ་བའི་འོས་ཡིན་པར་ཤེས་པ་གང་ཡིན་པ་དེ་དག་ནི། དེའི་སྐབས་སུ་དེ་བཞིན་གཤེགས་པས་དེ་བསྒྲུབ་པར་བྱ་བའི་ལུང་བསྟན་པའི་དུས་མཁྱེན་ནས། དྲན་པ་དང་ཤེས་བཞིན་དང་ལྡན་པས་བསྒྲུབ་པར་བྱའོ་ཞེས་ང་ཟེར་རོ། །
en: I have also said, ‘Given that the Tathāgata knows the right time to teach what should be adopted at any occasion, phenomena known by the mind that are suitable to adopt and adhere to should indeed be adopted by the mindful and vigilantly introspective.’ ”

source: སྤྲོས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལ་ཞུགས་པའི་དགེ་སློང་གི་སོ་སོར་ཐར་པའི་སྡོམ་པའི་རྒྱུ་ཆོས་དྲུག་མཆིས་ཏེ།
en: “There are six causal attributes of the prātimokṣa vow taken by the ordained who have entered the path that stops discursive elaboration. They are

source: མིག་གིས་ཤེས་པར་བགྱི་བའི་གཟུགས་རྣམས་དང་།
en: (1) the forms perceived by the eyes,

source: རྣ་བས་ཤེས་པར་བགྱི་བའི་སྒྲ་རྣམས་དང་།
en: (2) the sounds perceived by the ears,

source: སྣས་ཤེས་པར་བགྱི་བའི་དྲི་རྣམས་དང་།
en: (3) the smells perceived by the nose,

source: ལྕེས་ཤེས་པར་བགྱི་བའི་རོ་རྣམས་དང་།
en: (4) the tastes perceived by the tongue,

source: ལུས་ཀྱིས་ཤེས་པར་བགྱི་བའི་རེག་བྱ་རྣམས་དང་།
en: (5) the tangible objects perceived by the body, and

source: ཡིད་ཀྱིས་ཤེས་པར་བགྱི་བའི་ཆོས་རྣམས་ལགས་ཏེ།
en: (6) the phenomena perceived by the mind.
